FSharp/progfsh.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Programming F# by Chris Smith</title>
<!-- 2016-02-09 Tue 20:20 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="John Cumming" />
<link rel="stylesheet"
                         href="/css/solarized-dark.css"
                         type="text/css"/>
</head>
<body>
<div id="preamble" class="status">
<div id="my-header"><h2>jSolutions | <a href="/index.html">home</a></h2></div>
</div>
<div id="content">
<h1 class="title">Programming F# by Chris Smith</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Book Contents</a></li>
<li><a href="#sec-2">Good Points</a></li>
<li><a href="#sec-3">Bad Points</a></li>
<li><a href="#sec-4">Summary</a></li>
</ul>
</div>
</div>
<p>
I am currently learning F# as another string to the bow and all that. I
got myself a copy of Chris Smith's book Programming F# as part of
this, so thought it only right and proper to provide a review. Which
has also been added to the amazon web site. The book can be found
<a href="http://www.amazon.co.uk/Programming-F-Chris-Smith/dp/0596153643">here</a>.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Book Contents</h2>
<div class="outline-text-2" id="text-1">
<p>
The book starts with the obligatory introduction to the
language. The sections on lists were an exception but, as is usually
the case, it is only after this section that the book gets
interesting as it delves into different programming idioms:
functional, imperative and object oriented.
</p>

<p>
It was specifically as an introduction to functional programming
using F# that I bought this book, so it is from this perspective
that I shall procede. I won't particularly comment on the imperative
and oo sections, but suffice it to say they cover ther expected
areas and include areas such as exception handling and oo concepts
such as polymorphism through object inheritance. But not the kind of
stuff that I bought the book for.
</p>

<p>
The section on functional programming covers the basics of
functional programming including:
</p>

<ul class="org-ul">
<li>Immutability as a protection against unintended side effects, an
assist in writing parallel algorithms and generally providing more
readable code.
</li>
<li>Function Values, including anonymous functions (lambda
expressions), currying and returning functions.
</li>
<li>Recursive functions, including mutually recursive functions;
functions that call each other.
</li>
<li>Symbolic Operators via symbolic functions
</li>
<li>Function Composition using composition and pipe operators
</li>
<li>Pattern matching as a powerful version of the familiar C switch
statement
</li>
<li>Discriminated unions  and Sequences which can be used to represent
all kinds of structures and can be recursive.
</li>
<li>Skipping the sections on imperative and oo we are now up to
Chapter 6 : .NET Programming which shows how to integrate with the
.NET framework both as a consumer and provider.
</li>
</ul>

<p>
These first 6 chapters really provide a foundation for the next 2
chapters, entitled Applied Functional Programming and Applied
Object-Oriented Programming. These chapters then expand on concepts
from earlier in the book. The Applied Functional Programming chapter
develops pattern matching and lists further before looking in a bit
more detail at programming with functions.
</p>

<p>
Part 2 now picks up with more detail on programming with F# and has
a good sections on Asynchronous / Parallel programming and
Quotations.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Good Points</h2>
<div class="outline-text-2" id="text-2">
<p>
This is a book that I have recently bought and as is my usual style
I have very briefly flicked through it. It looks like exactly the
book I'm looking for as an experienced .NET programmer who is new,
not only to F#, but also to functional programmming. The concepts
appear laid out clearly and examples are good. I like the fact that
it does deal with both functional and oo programming as well as
integration with .NET.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Bad Points</h2>
<div class="outline-text-2" id="text-3">
<p>
To be honest I am not sure yet as I have not started doing real work
with F#, so any frustrations will appear over time. I can say
howefver that this is probably not going to be a good reference book
for F# as a language, or a cookbook of solutions.
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Summary</h2>
<div class="outline-text-2" id="text-4">
<p>
I suspect this book will be dipped in and out of as I work with F#
and time will tell how useful it is in the real world, but on first
glances, this is exactly the riught book if you are new to F# and
want to get stuck into developing with it straight away.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: John Cumming</p>
<p class="date">Created: 2016-02-09 Tue 20:20</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
